app/controllers/projects_controller.rb

  def create
    project = Project.create({text: params[:text], title: params[:title], img: params[:img]})
    params[:sentences].each do |sent|
      sentence = project.sentences.create({text: sent["text"]})
      sent["tones"].each do |tone|
        sentence.tones.create({score: tone["score"], tone_name: tone["tone_name"]})
      end
    end

    params[:tones].each do |tone|
      project.tones.create({score: tone["score"], tone_name: tone["tone_name"]})
---
INSERT INTO "projects" ("text", "created_at", "updated_at", "title", "img") VALUES (?, ?, ?, ?, ?)
SELECT "sentences".* FROM "sentences" WHERE "sentences"."project_id" = ?  [["project_id", 13]]
INSERT INTO "sentences" ("text", "project_id") VALUES (?, ?)  [["text", "Two things that I value greatly are creativity and the ability to figure out how things work."], ["project_id", 17]]
INSERT INTO "tones" ("score", "tone_name", "analyzable_id", "analyzable_type") VALUES (?, ?, ?, ?)  [["score", 0.743104], ["tone_name", "Analytical"], ["analyzable_id", 28], ["analyzable_type", "Sentence"]]
INSERT INTO "tones" ("score", "tone_name", "analyzable_id", "analyzable_type") VALUES (?, ?, ?, ?)  [["score", 0.609127], ["tone_name", "Joy"], ["analyzable_id", 17], ["analyzable_type", "Project"]]

  def delete
    project = Project.find(params[:id])
    render json: {project: project}
    project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 14]]