app/controllers/projects_controller.rb

  def index
    render json: Project.all, include:['document', 'document.document_tones', 'document.sentences', 'document.sentences.sentence_tones']
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."project_id" = ?  [["project_id", 13]]